<template>
	<div class="about-container">
		<h1>Тестовое задание “Eclipse Digital Studio”</h1>
		<p>
			<strong>Стек:</strong> Laravel v8^, VueJs v2^
		</p>
		<p>
			<strong>Цель задания:</strong>
		</p>
		<p>
			Реализовать небольшой форум, на котором можно просматривать, оценивать и писать статьи в
			различных категориях. Выбор тематика остается на усмотрение тестируемого.
		</p>
		<p>
			<strong>Подробнее:</strong>
		</p>
		<ul>
			<li>
				При входе на сайт пользователи видят категории статей, при клике открывается список статей данного форума,
				с названием, автором и частью текста данной статьи, размером не более 300 символов, а также количество оценок
				данной статьи.
			</li>
			<li>
				При клике на статью открывается детальная страница статьи со всем имеющейся информацией в статье, автором  количеством оценок данной статьи. 
			</li>
			<li>
				В шапке сайта должен находится логотип и краткое описание сайта, ссылка на главные категории сайта,
				ссылка на создание статьи (если пользователь авторизован), кнопка входа и регистрации, если пользователь
				авторизован вместо войти/зарегистрироваться необходимо вывести имя пользователя.
			</li>
			<li>
				Авторизованные пользователи могут писать статьи в выбранной категории(выбор производится с помощью селектора на странице создания статьи)
			</li>
			<li>
				Оценивать статьи могут только авторизованные пользователи, и только 1 раз каждую статью.
			</li>
		</ul>
		<p>
			<strong>Реализация:</strong>
		</p>
		<p>
			Вся клиентская часть приложения должна быть выполнена как SPA, с разделением на компоненты, с использованием VueCli, vue-router, vuex и другими необходимыми зависимостями на усмотрение тестируемого. Все данные должны приходить с API серверной части через запросы axios. 
			Серверная часть выполняется на Laravel 8^. Система аутентификации - Laravel Sanctum. 
		</p>
		<p>
			Требования к работе: чистый аккуратный код, соблюдение единой табуляции во всем проекте, адекватное разделение на
			компоненты, понятные читаемые переменные, наличие комментариев в коде будет большим плюсом.
		</p>
		<p>
			Внешний вид на усмотрение тестируемого, главное условие - интуитивно понятный и аккуратный.
		</p>
	</div>
</template>

<script>
export default {
	name: 'about',
	components: {
		//
	}
}
</script>

<style scoped>
	.about-container {
		margin: 0 auto;
		max-width: 900px;
	}

	h1 {
		font-family: 'Roboto', sans-serif;
		text-align: center;
		font-size: 38px;
		line-height: 45px;
		margin-bottom: 60px;
	}
</style>